const hse = [
  {
    tag: 'Высшая проба 2020',
    year: 2020,
    text: [
      ' {(17 баллов).} Для действительного числа $ \\alpha \\in (0,1) $ рассмотрим возрастающую последовательность всехнатуральных чисел $ m_i $, для которых $ {m_i \\alpha} < \\alpha $. Может ли для какого-то $ \\alpha $ соответствующая последовательность начинаться с \\begin{enumerate} \\item 2021, 4041, 6062? \\item 2021, 4042, 6062, 8082? \\end{enumerate}'
    ]
  },
  {
    tag: 'Высшая проба 2020',
    year: 2020,
    text: [
      ' {(20 баллов).} В последовательности чисел $ {2^0, 2^1, 2^2, \\ldots} $ некоторые члены умножили на $ -1 $, причем известно, что осталось бесконечно много положительных членов. Докажите что любое натуральное число представимо в виде суммы нескольких различных членов полученной последовательности.'
    ]
  },
  {
    tag: 'Высшая проба 2020',
    year: 2020,
    text: [
      ' {(26 баллов).} В ряд стоят $ n $ домов $ k $ различных цветов, причем для любого цвета найдутся $ 100 $ стоящих подряд домов, среди которых домов этого цвета строго больше, чем домов любого другого цвета. При каком наибольшем $ k $ это возможно, если \\begin{enumerate} \\item $ n=84 $? \\item $ n=86 $? \\end{enumerate}'
    ]
  },
  {
    tag: 'Высшая проба 2020',
    year: 2020,
    text: [
      ' {(23 балла).} В угол $ AOC $ вписаны окружности $ \\Omega_1 $ и $ \\Omega_2$ (радиус $ \\Omega_1 $ больше). $ \\Omega_1 $ касается сторон угла в точках $ A $ и $ B $, а $ \\Omega_2 $ – в точках $ D $ и $ C $ соответственно. Точка $ M $ – середина отрезка $ BC $. Прямые $ MA $ и $ MD $ вторично пересекают $ \\Omega_1 $ и $ \\Omega_2$ соответственно в точках $ X $ и $ Y $. Прямые $ BX $ и $ CY $ пересекаются в точке $ Z $. Докажите, что прямая $ MZ $ проходит через серединуотрезка $ AD $.'
    ]
  },
  {
    tag: 'Высшая проба 2020',
    year: 2020,
    text: [
      ' {(28 баллов).} Дана пара взаимно-простых многочленов с действительными коэффициентами $ P(x) $ и $ Q(x) $ степеней $ 2021 $ и $ 2000 $ соответственно (взаимно-простые означает, что не существуетмногочлена $ R(x) $, не равного константе, на который делятся $ P(x) $ и $ Q(x)) $. Гриша выбираетконечное множество действительных чисел $ c_1, \\ldots c_n $ (помните, в множестве элементы не повторяются, размер множества Гриша тоже выбирает сам), находит число различных кратных действительных корней у многочлена $ P(x)+c_i Q(x) $ (при $ i $ от $ 1 $ до $ n $) и складывает полученные числа. Какую наибольшую сумму Гриша может получить в результате этого процесса?'
    ]
  },
  {
    tag: 'Высшая проба 2020',
    year: 2020,
    text: [
      ' {(38 баллов).} ABC – равносторонний треугольник на плоскости, а $ S $ – круг, концентрический с описанной окружностью треугольника $ ABC $, но имеющий вдвое больший радиус, пусть его радиус равен 1. Применить к точке $ X $ на плоскости операцию – значит, отразить точку $ X $ симметрично относительно ближайшей вершины треугольника $ ABC $ (если ближайших вершин две, выбираем одну из двух произвольным образом). \\begin{enumerate} \\item  Докажите, что любая точка плоскости за конечное число операций попадет в круг $ S $. \\item Пусть $ d $ – расстояние от центра $ S $ до какой-то точки, попадающей в первый раз в круг $ S $ после ровно $ 2021 $ операции. Найдите промежуток возможных значений $ d $. \\end{enumerate}'
    ]
  },
  {
    tag: 'Высшая проба 2020',
    year: 2020,
    text: [
      ' {(34 балла).} Для таблички $ n×n $ рассматриваем семейство квадратов $ 2×2 $, состоящих из клеток таблицы, и обладающее свойством: для любого квадрата семейства найдется покрытая им клетка, не покрытая никаким другим квадратом из семейства. Через $ f(n) $ обозначим максимальное количество квадратов в таком семействе. Для какого наименьшего $ C $ неравенство $ f(n) \\leqslant Cn^2 $ верно при любом $ n $?'
    ]
  },
  {
    tag: 'Высшая проба 2019',
    year: 2019,
    text: [
      '  {(12 баллов)} На доске написана система из $ 12 $ различных уравнений с $ 6 $ неизвестными $ x_1, x_2, x_3 $, $ x_4, x_5, x_6 $. Каждое уравнение имеет вид $ x_i + x_j + x_k = 0 $, где $ i  e j  e k $ (сумма трех различных неизвестныхравна нулю). Могло ли оказаться так, что у системы бесконечно много решений?'
    ]
  },
  {
    tag: 'Высшая проба 2019',
    year: 2019,
    text: [
      ' {(15 баллов)} Дан описанный четырехугольник $ ABCD $, у которого радиусы вписанных окружностей треугольников $ ABC $ и $ ADC $ равны. Найдите угол между диагоналями $ AC $ и $ BD $.'
    ]
  },
  {
    tag: 'Высшая проба 2019',
    year: 2019,
    text: [
      ' {(18 баллов)}  Найдите все вещественные $ c $, при которых сумма девятых степеней корней уравнения $ x^2 - x + c = 0 $ равна нулю, и сумма пятнадцатых степеней тоже равна нулю. Замечание: корни могут быть комплексными.'
    ]
  },
  {
    tag: 'Высшая проба 2019',
    year: 2019,
    text: [
      ' {(25 баллов)} Точки $ P $ и $ Q $ лежат соответственно на сторонах $ BC $ и $ CD $ квадрата $ ABCD $. Прямые $ AP $ и $ AQ $ пересекают $ BD $ в точках $ M $ и $ N $ соответственно, а прямые $ PN $ и $ QM $ пересекаются в точке $ H $. Докажите, что $ AH \\perp PQ $ тогда и только тогда, когда точки $ P, Q, M, N $ лежат на одной окружности.'
    ]
  },
  {
    tag: 'Высшая проба 2019',
    year: 2019,
    text: [
      ' {(32 балла)} Дано несколько вещественных чисел, по модулю не превосходящих $ 1. $ Сумма всех чисел равна $ S $. Докажите, что из них можно выбрать несколько чисел так, чтобы при некотором натуральном $ n < 100 $ сумма выбранных чисел отличалась от $ \\frac{nS}{100} $ не более чем на $ \\frac{1}{100} $.'
    ]
  },
  {
    tag: 'Высшая проба 2019',
    year: 2019,
    text: [
      ' {(28 баллов)} В правильном тетраэдре с ребром, равным $ 8, $ отмечены $ 25 $ различных точек: 4 вершины и $ 21 $ произвольная точка внутри тетраэдра. Никакие $ 4 $ отмеченные точки не лежат в одной плоскости. Докажите, что найдется тетраэдр с вершинами в отмеченных точках, объем которого меньше единицы.'
    ]
  },
  {
    tag: 'Высшая проба 2019',
    year: 2019,
    text: [
      ' Даны $ m $ подмножеств $ n $-элементного множества: $ A_1, \\ldots , A_m $. Обозначим через $ |A_i| $ число элементов множества $ A_i $. Рассмотрим неравенство $ n^2 \\sum_{i,j,k=1}^{m} = |A_i \\cap A_j \\cap A_k|  \\geqslant (|A_1|+ \\ldots |A_m|)^3 , $ в котором индексы $ i, j, k $ пробегают все значения от $ 1 $ до $ m $, то есть в сумме всего $ m^3 $ слагаемых. \\begin{enumerate} \\item  {(15 баллов)} Докажите это неравенство при $ m = 3 $. \\item  {(25 баллов)} Докажите это неравенство при произвольном натуральном $ m $. \\end{enumerate}'
    ]
  },
  {
    tag: 'Высшая проба 2018',
    year: 2018,
    text: [
      ' Про вещественные числа $ a, b $ и $ c $ известно, что $ abc + a + b + c = 10  $ и $ ab + bc + ac = 9.  $Длякаких чисел $ x $ можно утверждать, что хотя бы одно из чисел $ a, b, c $ равно $ x $? (Найдите все такие числа $ x $ и докажите, что других нет.)'
    ]
  },
  {
    tag: 'Высшая проба 2018',
    year: 2018,
    text: [
      '  Мистер $ A $ час простоял в точке с координатами $ (0, 0) $. За этот же час, двигаясь равномерно и прямолинейно, мистер $ B $ дошел от точки $ (22, 0) $ до точки $ (2, 20) $. За этот же час мадемуазель $ C, $ тоже двигавшаяся равномерно и прямолинейно, прошла от точки $ (30, 4) $ до точки $ (0, 24) $. Сколько раз за указанный период наблюдения принимала целые значения площадь треугольника $ ABC $? Начальный и конечный момент включаются.'
    ]
  },
  {
    tag: 'Высшая проба 2018',
    year: 2018,
    text: [
      ' Из $ n $ правильных шестиугольников со стороной $ 1 $ сделали многоугольник на плоскости, склеивая шестиугольники по сторонам. Любые два шестиугольника либо имеют ровно одну общую сторону, либо вообще не имеют общих точек. Внутри многоугольника нет дыр. При этом у каждого шестиугольника хотя бы одна сторона лежит на границе многоугольника. Какой наименьший периметр может иметь многоугольник при данных условиях? '
    ]
  },
  {
    tag: 'Высшая проба 2018',
    year: 2018,
    text: [
      '  Через вершины треугольника $ ABC $ проведены три параллельные прямые $ a, b, c $ соответственно, не параллельные сторонам треугольника. Пусть $ A_0, B_0, C_0  $— середины сторон $ BC, $ CA, AB. Пусть $ A_1, B_1, C_1  $— точки пересечения пар прямых $ a $ и $ B_0C_0, b $ и $ C_0A_0, c $ и $ A_0B_0 $ соответственно. Докажите, что прямые $ A_0A_1, B_0B_1 $ и $ C_0C_1 $ пересекаются в одной точке.'
    ]
  },
  {
    tag: 'Высшая проба 2018',
    year: 2018,
    text: [
      ' Рассмотрим всевозможные приведенные квадратные трехчлены $ x^2 + px + q $ с целыми коэффициентами $ p $ и $ q $. Назовем областью значений такого трехчлена множество его значений во всех целых точках $ x = 0, \\pm1, \\pm2 , \\ldots $ . Какое наибольшее количество таких трехчленов можно выбрать, чтобы их области значений попарно не пересекались?'
    ]
  },
  {
    tag: 'Высшая проба 2018',
    year: 2018,
    text: [
      '  Последовательность чисел $ \\tau(1), \\tau(2), \\ldots, \\tau(n) $ называется перестановкой длины $ n $, если каждое из чисел $ 1, 2, \\ldots , n $ встречается в этой последовательности ровно один раз. Например, $ \\tau(1) = 3, \\tau(2)=2, \\tau(3) =1$ — перестановка длины $ 3. $ Найдите все $ n,  $ для которых найдется перестановка $ \\tau(1), \\tau(2), \\ldots, \\tau(n) $, удовлетворяющая четырем условиям: \\begin{itemize} \\item Числа $ \\tau(i) - i $ для всех $ i $ от $ 1  $ до $ n $ включительно имеют попарно различные остатки от деления на $ n. $ \\item Числа $ \\tau(i) - 2i $ для всех $ i $ от $ 1  $ до $ n $ включительно имеют попарно различные остатки от деления на $ n. $ \\item Числа $ \\tau(i) - 3i $ для всех $ i $ от $ 1  $ до $ n $ включительно имеют попарно различные остатки от деления на $ n. $ \\item Числа $ \\tau(i) - 4i $ для всех $ i $ от $ 1  $ до $ n $ включительно имеют попарно различные остатки от деления на $ n. $ \\end{itemize} '
    ]
  },
  {
    tag: 'Высшая проба 2017',
    year: 2017,
    text: [
      ' От домика Тофслы и Вифслы отходят $ 6 $ прямых дорог, разделяющих окрестное круглое поле на $ 6 $ равных секторов. Тофсла и Вифсла отправляются в путешествие из своего домика в центре поля со скоростью $ 5 $ км/ч случайно независимо друг от друга выбрав себе дорогу, по которой идти. С какой вероятностью расстояние между ними через час составит более $ 7 $ км?'
    ]
  },
  {
    tag: 'Высшая проба 2017',
    year: 2017,
    text: [
      ' Фонари располагаются на плоскости, освещая все точки угла южнее и западнее себя. (То есть фонарь в точке с координатами $ (a, b) $ освещает точки $ (x, y) $ с координатами $ x \\leqslant a $ и $ y \\leqslant b $.) На плоскость уже выставили $ 2018 $ синих фонарей, поместив их в различные точки. Можно ли дорасставить на плоскости $ 2017 $ красных фонарей, так что любая точка плоскости, освещённая ровно $ k > 0 $ синими фонарями, будет освещена ровно $ k - 1 $ красным фонарём? (Красные фонари можно располагать в точки, занятые другими фонарями, предполагая, что это не мешает освещению).'
    ]
  },
  {
    tag: 'Высшая проба 2017',
    year: 2017,
    text: [
      '  Треугольник $ ABC, $ в котором $ AB > AC $, вписан в окружность с центром в точке $ O. $ В нём проведены высоты $ AA_0 $ и $ BB_0 $, и $ BB_0 $ повторно пересекает описанную окружность в точке $ N. $ Пусть $ M $ — середина отрезка $ AB. $ Докажите, что если $ \\angle OBN = \\angle NBC $, то прямые $ AA_0 $, $ ON $ и $ MB_0 $ пересекаются в одной точке.'
    ]
  },
  {
    tag: 'Высшая проба 2017',
    year: 2017,
    text: [
      '  В таинственном лесу два мудреца в чёрном и белом колпаках раздают гномикам грибочки. К ним в две очереди выстроились $ 2n $ гномиков, n в чёрных и $ n $ в белых колпаках.Если к мудрецу подходит гномик с таким же цветом колпака, то гномик получает грибочек и удаляется, а иначе отправляется в конец очереди к другому мудрецу. За какое наименьшее количество направлений в другую очередь мудрецы могут раздать всем гномикам по грибочку, если в процессе раздачи мудрецы могут один раз поменяться колпаками? (Мудрецы самирешают, в какой момент и к кому из них подойдёт следующий гномик из соответствующей очереди. Очереди могут быть разной длины. Все грибочки совершенно одинаковы.)'
    ]
  },
  {
    tag: 'Высшая проба 2017',
    year: 2017,
    text: [
      '  Из натурального числа $ n $ разрешается получить либо число $ n^2 + 2n $, либо число $ n^3 + 3n^2 + 3n $. Два натуральных числа называются совместимыми, если из них можно получить одно и то же число с помощью некоторого количества таких операций. Найдите все числа, совместимые с числом $ 2018 $.'
    ]
  },
  {
    tag: 'Высшая проба 2017',
    year: 2017,
    text: [
      '  В пространстве даны $ 5 $ точек, таких что в проекциях на координатные плоскости никакие три точки не лежат на одной прямой. Могло ли оказаться так, что каждая точка ровнов одной из этих проекций лежит внутри выпуклой оболочки остальных? (Мы говорим, чтоточка \\textit{лежит внутри выпуклой оболочки других точек}, если она лежит внутри треугольника с вершинами в некоторых трёх из этих точек.)'
    ]
  },
  {
    tag: 'Высшая проба 2016',
    year: 2016,
    text: [
      ' В компании из $ 6 $ человек некоторые компаниями по трое ходили вместе в походы. Верно ли, что среди них найдутся четверо, среди которых каждые трое ходили вместе в поход, либо четверо, где никакие трое не ходили вместе в поход?'
    ]
  },
  {
    tag: 'Высшая проба 2016',
    year: 2016,
    text: [
      '  На окружности с центром $ O $ расположим шестёрку точек $ P_1, \\ldots , P_6 $. Назовём шестёркуинтересной, если $ \\overrightarrow{OP_1}+ \\ldots + \\overrightarrow{OP_6} = 0 $, и все углы $ \\angle  P_iOP_j $ целые в градусах. Назовём шестёрку скучной, если она переводится в себя отражением от точки $ O $ или поворотом вокруг $ O $ на $ 120^\\circ $. Существуют ли интересные нескучные шестёрки точек на окружности?'
    ]
  },
  {
    tag: 'Высшая проба 2016',
    year: 2016,
    text: [
      '  Выпуклый многогранник имеет $ 8 $ вершин и $ 6 $ четырёхугольных граней. Может ли проекция этого многогранника на некоторую плоскость оказаться правильным $ 8 $-угольником?'
    ]
  },
  {
    tag: 'Высшая проба 2016',
    year: 2016,
    text: [
      '  Тройка целых чисел $ (x, y, z) $, наибольший общий делитель которых равен $ 1, $ является решением уравнения  $ y^2z + yz^2 = x^3 + x^2z - 2xz^2 $ . Докажите, что $ z $ является кубом целого числа $ 5 $. Числа $ P_1, \\ldots , P_n $ являются перестановкой набора чисел $ \\{1, \\ldots , n\\} $ (то есть каждое $ P_i $ равно одному из $ 1, \\ldots , n $, и все $ P_i $ различны). Докажите неравенство $ \\sum_{i=1}^{n-1}\\dfrac{1}{P_i + P_{i+1}} > \\dfrac{n-1}{n+2} .$'
    ]
  },
  {
    tag: 'Высшая проба 2016',
    year: 2016,
    text: [
      '  Высоты $ AA_1, BB_1, CC_1 $ остроугольного треугольника $ ABC $ пересекаются в точке $ H. $ Пусть $ M  $— середина стороны $ BC, K  $— середина $ B_1C_1. $ Докажите, что окружность, проходящая через $ K, H $ и $ M, $ касается $ AA_1 $'
    ]
  },
  {
    tag: 'Высшая проба 2015',
    year: 2015,
    text: [
      ' Три различных положительных числа являются тремя последовательными членами арифметической прогрессии. Могут ли эти же три числа оказаться тремя (не обязательно последовательными) членами геометрической прогрессии?'
    ]
  },
  {
    tag: 'Высшая проба 2015',
    year: 2015,
    text: [
      ' Вокруг треугольника $ ABC $ с углом $ B = 60^\\circ $ описана окружность. Касательные к окружности, проведённые в точках $ A $ и $ C $, пересекаются в точке $ B_1 $. На лучах $ AB $ и $ CB $ отметили точки $ A_0 $ и $ C_0 $ соответственно так, что $ AA_0 = AC = CC_0 $. Докажите, что точки $ A_0 $, $ C_0 $, $ B_1 $ лежат на одной прямой.'
    ]
  },
  {
    tag: 'Высшая проба 2015',
    year: 2015,
    text: [
      '  Функция $ f(x) $, определённая при всех действительных $ x $, является чётной. Кроме того, при любом действительном x выполняется равенство $ f(x) + f(10 - x) = 4 $. \\begin{enumerate} \\item Приведите пример такой функции, отличной от константы. \\item Докажите, что любая такая функция является периодической. \\end{enumerate}'
    ]
  },
  {
    tag: 'Высшая проба 2015',
    year: 2015,
    text: [
      '  Петя хочет проверить знания своего брата Коли — победителя олимпиады «Высшая проба» по математике. Для этого Петя задумал три натуральных числа $ a, b, c $ и вычислил $ x = \\text{НОД}(a, b) $, $ y = \\text{НОД}(b, c) $, $ z = \\text{НОД}(c, a) $. Затем он написал на доске три ряда по пять чисел в каждом: \\begin{center} \\begin{tabular}{ccccc}  6 & 8 & 12 & 18 & 24 \\\\  14 & 20 & 28 & 44 &  56 \\\\ 5 & 15 & 18 &  27 & 42  \\end{tabular} \\end{center} Петя сообщил Коле, что одно из чисел в первом ряду равно $ x $, одно из чисел во втором ряду равно $ y $, одно из чисел в третьем ряду равно $ z $, и попросил угадать числа $ x, y, z $. Подумав несколько минут, Коля справился с задачей, правильно назвав все три числа. Назовите их и вы. Докажите, что существует единственная такая тройка $ (x, y, z) $.'
    ]
  },
  {
    tag: 'Высшая проба 2015',
    year: 2015,
    text: [
      '  Два коридора высотой и шириной в $ 1 $ м идут перпендикулярно друг другу по первому и второму этажу здания. Разделяющее их перекрытие разобрано, образуя дыру $ 1 \\times 1 $ м в полу одного и в потолке другого. Какова максимальная длина балки, которую можно передать из одного коридора в другой через дыру? (Балку считать негнущимся отрезком нулевой толщины. Толщина перекрытия также равна нулю, т. е. пол верхнего коридора и потолок нижнегокоридора находятся в одной плоскости.)'
    ]
  },
  {
    tag: 'Высшая проба 2015',
    year: 2015,
    text: [
      ' Таблица $ n \\times n $ заполняется натуральными числами от $ 1 $ до $ 2016 $ так, чтобы ни в одной строке и ни в одном столбце не было двух одинаковых чисел. Совпадение чисел, стоящих в разных столбцах и строках, допускается. Пусть $ f(n) $ — количество таких расстановок. Например, $ f(1) = 2016, f(2017) = 0 $. \\begin{enumerate} \\item Что больше: $ f(2015) $ или $ f(2016) $? \\item Что больше: $ f(1008) $ или $ f(1009) $? \\end{enumerate}'
    ]
  },
  {
    tag: 'Высшая проба 2014',
    year: 2014,
    text: [' ']
  },
  {
    tag: 'Высшая проба 2014',
    year: 2014,
    text: [
      'В стране Лимпопо есть четыре национальные валюты: бананы $ (\\text{Б}) $, кокосы $ (\\text{К}) $, еноты $ (\\text{E}) $ и доллары $ ( \\text{\\textdollar}) $. Ниже приведены курсы обмена этих валют (одинаковые во всех обменных пунктах страны):$ \\hspace{3mm} \\text{Б}   \\overset{2}{ \\underset{ \\frac{1}{2}}{ \\rightleftarrows}} \\text{К} \\hspace{3mm} \\mathcal{E} \\overset{6}{ \\underset{ \\frac{1}{6}}{ \\rightleftarrows}} \\text{Б} \\hspace{3mm} \\mathcal{E} \\overset{11}{ \\underset{ \\frac{1}{11}}{ \\rightleftarrows}}  \\text{К} \\hspace{3mm} \\text{\\textdollar}  \\overset{10}{ \\underset{ \\frac{1}{15}}{ \\rightleftarrows}}  \\text{К} $ Число на стрелке показывает, сколько единиц, указанных в конце стрелки, можно получить	за единицу, указанную в начале стрелки. Например одного енота можно обменять на $ 6 $ бананов	или на $ 11 $ кокосов, один доллар на $ 10 $ кокосов а один кокос — на $ \\frac{1}{15} $ доллара. (При решении	задачи любую валюту можно дробить на сколь угодно мелкие части: например обменять $ \\frac{101}{43} $ енота на $ \\frac{606}{43} $ банана). Обмены $ \\text{\\textdollar} \\rightleftarrows E $ и $ \\text{\\textdollar} \\rightleftarrows  \\text{Б} $ в Лимпопо запрещены. Перевозить деньги через границу Лимпопо можно только в долларах. Дядя Вася приехал в	Лимпопо, имея при себе $ 100 $ долларов. Он может выполнять указанные выше операции обмена валют неограниченное количество раз, но не имеет никаких других источников дохода. Может ли он разбогатеть и увезти из Лимпопо $ 200 $ долларов? Если да — объясните, как. Если нет,	докажите.'
    ]
  },
  {
    tag: 'Высшая проба 2014',
    year: 2014,
    text: [
      ' Даны три точки $ A, B, C $, образующие треугольник с углами $ 30^\\circ $, $ 45^\\circ $, $ 105^\\circ $. Выбираютсядве из этих точек, и проводится серединный перпендикуляр к отрезку, их соединяющему, после чего третья точка отражается относительно этого серединного перпендикуляра. Получаем четвёртую точку $ D $. С получившимся набором из 4 точек осуществляется та же процедура — выбираются две точки, проводится серединный перпендикуляр и все точки отражаются относительно него. Какое наибольшее количество различных точек можно получить в результате многократного повторения этой процедуры?'
    ]
  },
  {
    tag: 'Высшая проба 2014',
    year: 2014,
    text: [
      ' Приведите пример функции $ f(x) $, для которой выполняются все три перечисленных ниже условия: \\begin{itemize} \\item область определения функции $ f(x) $ — множество всех дейстительных чисел $ \\mathbb{R} $; \\item при любом $ b \\in \\mathbb{R} $ уравнение $ f(x) = b $ имеет ровно одно решение; \\item при любом $ a > 0 $ и любом $ b \\in \\mathbb{R} $ уравнение $ f(x) = ax + b $ имеет не менее двух решений. \\end{itemize}'
    ]
  },
  {
    tag: 'Высшая проба 2014',
    year: 2014,
    text: [
      ' Обозначим через $ T_k $ произведение первых $ k $ нечётных простых чисел: $ T_1 = 3 $, $ T_2 = 3 \\cdot 5 $, $ T_6 = 3 \\cdot 5 \\cdot 7 \\cdot 11 \\cdot 13 \\cdot 17 $ и т. д. Для каждого натурального $ k $ найти количество натуральных чисел $ n $ таких, что число $ n^2 + T_k n $ является точным квадратом натурального числа. Решить задачу: а) для $ k = 1 $; б) для $ k = 2 $; в) для произвольного заданного натурального $ k $.'
    ]
  },
  {
    tag: 'Высшая проба 2014',
    year: 2014,
    text: [
      ' В пространстве даны $ 270 $ шаров равных радиусов, любые два из которых пересекаются. Докажите, что среди них можно выбрать $ 10 $ шаров так, что найдётся точка, принадлежащая всем выбранным шарам.'
    ]
  },
  {
    tag: 'Высшая проба 2013',
    year: 2013,
    text: [
      ' На координатной плоскости нарисовано множество точек, заданное уравнением $ x = y^2 $. Окружность радиуса 5 с центром в точке (11, 1) пересекает это множество в точках $ A, B, C $ и $ D $. Докажите, что все точки $ A, B, C, D $ лежат на одной параболе, т. е. на кривой, задаваемой уравнением $ y = ax^2 + bx + c $, и найдите уравнение этой параболы.'
    ]
  },
  {
    tag: 'Высшая проба 2013',
    year: 2013,
    text: [
      ' Через вершины правильного шестиугольника проведены шесть различных параллельных прямых. Может ли оказаться так, что все попарные расстояния между этими прямыми являются целыми числами?'
    ]
  },
  {
    tag: 'Высшая проба 2013',
    year: 2013,
    text: [
      '  Последовательность $ a_n $ строится следующим образом: $ a_1 $, $ a_2 $ — произвольные действительныечисла, при $ n \\geqslant 3 $ число $ a_n $ равно наименьшему из чисел $ |a_i - a_j| $, $ 1 \\leqslant i < j \\leqslant n-1 $. Например, если $ a_1 = 6 $, $ a_2 = \\frac{19}{2} $, то получаем последовательность  $ 6, \\frac{19}{2}, \\frac{7}{2}, \\frac{5}{2}, 1, 1, 0, 0, 0, \\ldots $ При некотором выборе $ a_1, a_2 $ получилась последовательность, в которой $ a_{10} = 1 $. Найдите наименьшее возможное значение $ a_3 $ в такой последовательности.'
    ]
  },
  {
    tag: 'Высшая проба 2013',
    year: 2013,
    text: [
      ' Многогранник вписан в сферу радиуса $ R $, а его объём численно равен площади его поверхности. \\begin{enumerate} \\item Докажите, что $ R > 3 $. \\item Может ли $ R $ быть больше $ 1000 $? \\end{enumerate}'
    ]
  },
  {
    tag: 'Высшая проба 2013',
    year: 2013,
    text: [
      '  Пусть $ p >  $2 — целое число, не делящееся на $ 3 $. Докажите, что существуют такие целые числа $ a_1, a_2, \\ldots , a_k $, что $   -\\frac{p}{2}< a_1 < a_2 < \\ldots < a_k < \\frac{p}{2}  $ и произведение $  \\frac{p - a_1}{|a1|} \\cdot \\frac{p - a_2}{|a2|} \\cdot \\frac{p - a_k}{|ak|} $ равно $ 3^m $ для некоторого натурального $ m $.'
    ]
  },
  {
    tag: 'Высшая проба 2013',
    year: 2013,
    text: [
      ' На клетчатой доске размером $ 2 \\times n $ клеток некоторые клетки закрашиваются в чёрный цвет. Раскраска называется правильной, если среди закрашенных нет двух соседних клеток (соседними называются клетки, имеющие общую сторону). Раскраска, в которой ни одна клетка не закрашена, тоже считается правильной. Пусть $ A_n $ — количество правильных раскрасок с чётным числом закрашенных клеток, $ B_n $ — количество правильных раскрасок с нечётным числом закрашенных клеток. Найдите все возможные значения $ A_n - B_n $.'
    ]
  },
  {
    tag: 'Высшая проба 2012',
    year: 2012,
    text: [
      ' Найдите все целочисленные решения $ (x, y) $ уравнения $ 3x^2-y^2 =  3^{x+y} $ и докажите, что другихнет.'
    ]
  },
  {
    tag: 'Высшая проба 2012',
    year: 2012,
    text: [
      ' Триномом степени $ p $ называется функция вида $ f(x) = x^p + ax^q + 1 $, где $ p, q $ — натуральные числа, $ q < p $, и $ a $ — произвольное вещественное число (быть может, равное нулю). Найдите всепары триномов, которые дают в произведении трином степени $ 15 $.'
    ]
  },
  {
    tag: 'Высшая проба 2012',
    year: 2012,
    text: [
      ' Улитка, имеющая постоянную скорость $ 40 $ см/ч, начала ползти по цилиндрической колонне из точки $ A $. Каждые $ 15 $ минут она поворачивала поочерёдно то влево, то вправо на $ 90^\\circ $, а всё остальное время ползла прямо. (Углы и длины измеряются на плоской развёртке колонны.) Через $ 1 $ час $ 45 $ минут после начала путешествия улитка заметила, что снова оказалась в точке $ A $, а через $ 12,5 $ часов после начала путешествия захотела вернуться в точку $ A $ по кратчайшему пути, уже никуда не сворачивая. Какое расстояние ей придётся проползти?'
    ]
  },
  {
    tag: 'Высшая проба 2012',
    year: 2012,
    text: [
      ' Вместо крестиков в выражении $ \\times \\cdot \\times + \\times \\cdot \\times + \\ldots + \\times \\cdot \\times $ ($ 50 $ слагаемых) расставили числа $ 1, \\ldots, 100 $, каждое по одному разу. Какое максимальное и минимальное значение может иметьполученное выражение?'
    ]
  },
  {
    tag: 'Высшая проба 2012',
    year: 2012,
    text: [
      ' Пусть $ x, y $ и $ z $ — произвольные вещественные числа. Какое наименьшее значение можетпринимать выражение  $ \\sqrt{1+x^2} + \\sqrt{1 + (x-y)^2} + \\sqrt{1 + (y - z)^2} + \\sqrt{1 + (3-z)^2} ? $ Обоснуйте свой ответ.'
    ]
  },
  {
    tag: 'Высшая проба 2012',
    year: 2012,
    text: [
      ' Даны два высоких цилиндрических стакана радиусов $ r $ и $ R, r < R $. Широкий поставили на горизонтальный стол, а узкий всевозможными способами помещают на него так, что он опирается на кромку широкого двумя точками своей кромки и одной точкой боковой поверхности(см. рисунок). Опишите геометрическое место точек пространства, в которых при этом может оказаться верхняя точка кромки узкого стакана, соприкасающейся с широким.'
    ]
  },
  {
    tag: 'Высшая проба 2011',
    year: 2011,
    text: [
      ' Найдите все пары взаимно простых натуральных чисел $ a $ и $ b $ такие, что $ 2a^2 + 3b^2 $ делится на $ 2a + 3b $.'
    ]
  },
  {
    tag: 'Высшая проба 2011',
    year: 2011,
    text: [
      ' Найдите максимальное число частей, на которые могут разбить плоскость графики десяти квадратичных функций $ y = ax^2 + bx + c $, $ a  e 0 $.'
    ]
  },
  {
    tag: 'Высшая проба 2011',
    year: 2011,
    text: [
      ' При каком значении параметра a график многочлена $ x^4 - 6x^3 + 12x^2 + ax $ симметричен относительно прямой $ x = c $ для какого-нибудь значения константы $ c $ ?'
    ]
  },
  {
    tag: 'Высшая проба 2011',
    year: 2011,
    text: [
      ' В пространстве выбраны четыре точки, все координаты каждой из которых делятся на $ 3 $, причём эти точки не лежат в одной плоскости. Какое минимальное число точек, все координаты которых чётны, может содержаться в тетраэдре, вершинами которого являются выбранные четыре точки? (Содержаться — значит лежать внутри, на грани, на ребре или в вершине.)'
    ]
  },
  {
    tag: 'Высшая проба 2011',
    year: 2011,
    text: [
      ' Описанный четырёхугольник $ ABCD $ делится диагональю $ AC $ на два подобных, но не равныхтреугольника. Чему может быть равна длина диагонали $ AC $, если длины сторон $ AB $ и $ CD $ равны $ 5 $ и $ 10 $ соответственно?'
    ]
  },
  {
    tag: 'Высшая проба 2011',
    year: 2011,
    text: [
      ' В одной из вершин правильного $ 2n $-угольника ($ n > 2 $) поставлено число $ 1 $. Для данной расстановки чисел $ 2, 3, \\ldots , 2n $ в остальные вершины $ 2n $-угольника поставим на каждой его стороне знак $ + $, если число на конце стороны (при движении по часовой стрелке) больше числа на еёначале, и знак $ - $, если оно меньше. Докажите, что модуль разности между числом расстановок чисел $ 2, 3, \\ldots , 2n $ с чётным количеством плюсов на сторонах и числом расстановок с нечётнымколичеством плюсов равен числу расстановок, в которых плюсы и минусы чередуются, при(а) $ n = 3 $; (б) $ n = 4 $; (в) произвольном $ n $.'
    ]
  }
]

export default hse
