  const economy =  [
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        " В кредит взяли $220$ тысяч рублей на $5$ лет под $r\\%$ годовых. По условиям кредита, на конец первых трех лет задолженность остается неизменной и равной $220$ тысячам рублей, а выплаты последних двух лет равны. На конец пятого года кредит должен быть погашен. Найдите  $r$ если известно, что сумма всех выплат составит $420$ тысяч рублей."
      ]
    },
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        " В июле $2026$ года планируется взять кредит на пять лет в размере $S$ тысяч рублей. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item каждый январь долг возрастает на $ 30\\% $ по сравнению с концом предыдущего года;\n\t\t\t\\item с февраля по июнь каждого года необходимо выплатить одним платежом часть долга; \\item в июле $2027$, $2028$ и $2029$ годов долг остается равным $S$ тысяч рублей; \\item выплаты в $2030$ и $2031$ годах равны по $338$ тысяч рублей; \\item к июлю $2031$ года долг будет выплачен полностью.\n\t\t\\end{\\itemize}\n\n\t\tНайдите общую сумму выплат за пять лет. "
      ]
    },
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        " В июле $2020$ года планируется взять кредит в банке на сумму $ 250 000 $ рублей. Известно, что банк каждый год увеличивает сумму кредита на $r\\%$, после чего происходит платеж. Кредит был полностью выплачен за $2$ года. Найдите $r$, если первый платеж составил $ 150 000 $ рублей, а второй $ 180 000 $ рублей."
      ]
    },
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        " В июле $2020$ года планируется взять кредит в банке на сумму $ 400 000 $ рублей. Известно, что банк каждый год увеличивает сумму кредита на $r\\%$, после чего происходит платеж. Кредит был полностью выплачен за $2$ года. Найдите $r$, если первый платеж составил $ 330 000 $ рублей, а второй $ 121 000 $ рублей."
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        " В июле $2026$ года планируется взять кредит в банке на три года в размере $S$ млн. рублей, где $ S $ — целое число. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item каждый январь долг увеличивается на $ 20\\% $ по сравнению с концом предыдущего года;\n\t\t\t\\item с февраля по июнь каждого года необходимо выплатить одним платежом часть долга; \\item в июле каждого года долг должен составлять часть кредита в соответствии со следующей таблицей:\n\t\t\\end{\\itemize}\n\t\t\\begin{\\center}\n\t\t\t\\begin{\\tabular}{ |c|c|c|c|c| }\n\t\t\t\t \\hline Месяц и год & Июль 2026 & Июль 2027 & Июль 2028 & Июль 2029 \\\\ \\hline Долг (в млн. рублей) & $ S$ & $ 0,8 S$ & $ 0,4 S$ & $ 0$ \\\\ \\hline \n\t\t\t\\end{\\tabular}\n\t\t\\end{\\center}\n\t\tНайдите наибольшее $ S $, при котором каждая из выплат будет меньше $5$ млн. руб. "
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        " В июле планируется взять кредит в банке на сумму $6$ млн. рублей на срок $15$ лет. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item каждый январь долг возрастает на $ x \\%$ по сравнению с концом предыдущего года;\n\t\t\t\\item с февраля по июнь каждого года необходимо выплатить часть долга; \\item в июле каждого года долг должен быть на одну и ту же величину меньше долга на июль предыдущего года.\n\t\t\\end{\\itemize}\n\n\t\tНайдите $ x $, если известно, что наибольший платёж по кредиту составит не более $ 1,9 $ млн. рублей, а наименьший — не менее $ 0,5 $ млн. рублей. "
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        " В июле планируется взять кредит в банке на сумму $3$ млн. рублей на некоторый срок (целое число лет). Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item каждый январь долг возрастает на $ 20\\% $ по сравнению с концом предыдущего года;\n\t\t\t\\item с февраля по июнь каждого года необходимо выплатить часть долга; \\item в июле каждого года долг должен быть на одну и ту же сумму меньше долга на июль предыдущего года.\n\t\t\\end{\\itemize}\n\n\t\tЧему будет равна общая сумма выплат после полного погашения кредита, если наименьший годовой платёж составит $ 0,24 $ млн. рублей? (Считайте, что округления при вычислении платежей не производятся). "
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        " В июле $2022$ года планируется взять кредит на сумму $ 177 120 $ рублей. Условия возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item в январе каждого года долг увеличивается на $ 25\\% $ по сравнению с предыдущим годом;\n\t\t\t\\item с февраля по июнь нужно выплатить часть долга одним платежом.\n\t\t\\end{\\itemize}\n\n\t\tСколько рублей будет выплачено банку, если известно, что кредит будет полностью погашен четырьмя равными платежами (то есть за четыре года)? "
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        " 15-го декабря планируется взять кредит в банке на $21$ месяц. Условия возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item 1-го числа каждого месяца долг возрастает на $ 3\\% $ по сравнению с концом предыдущего месяца;\n\t\t\t\\item со 2-го по 14-е число каждого месяца необходимо выплатить часть долга; \\item 15-го числа каждого месяца с 1-го по 20-й долг должен быть на $30$ тысяч рублей меньше долга на 15-е число предыдущего месяца; \\item к 15-му числу 21-го месяца кредит должен быть полностью погашен.\n\t\t\\end{\\itemize}\n\n\t\tКакую сумму планируется взять в кредит, если общая сумма выплат после полного его погашения составит $1604$ тысяч рублей? "
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        " 15-го декабря планируется взять кредит в банке на $13$ месяцев. Условия возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item 1-го числа каждого месяца долг возрастает на $ 2\\% $ по сравнению с концом предыдущего месяца;\n\t\t\t\\item со 2-го по 14-е число каждого месяца необходимо выплатить часть долга; \\item 15-го числа каждого месяца с 1-го по 12-й долг должен быть на $50$ тысяч рублей меньше долга на 15-е число предыдущего месяца; \\item к 15-му числу 13-го месяца кредит должен быть полностью погашен.\n\t\t\\end{\\itemize}\n\n\t\tКакую сумму планируется взять в кредит, если общая сумма выплат после полного его погашения составит $ 804 $ тысячи рублей? "
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        " 15-го декабря планируется взять кредит в банке на сумму $1100$ тысяч рублей на $31$ месяц. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item 1-го числа каждого месяца долг возрастает на $ 2\\% $ по сравнению с концом предыдущего месяца;\n\t\t\t\\item со 2-го по 14-е число каждого месяца необходимо выплатить часть долга; \\item 15-го числа каждого месяца с 1-го по 30-й долг должен быть на одну и ту же сумму меньше долга на 15-е число предыдущего месяца; \\item к 15-му числу 31-го месяца кредит должен быть полностью погашен.\n\t\t\\end{\\itemize}\n\t\tКакой долг будет 15-го числа 30-го месяца, если общая сумма выплат после полного погашения кредита составит $1503$ тысячи рублей? "
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        " Зависимость объёма $ Q $ (в шт.) купленного у фирмы товара от цены $ P $ (в руб. за шт.) выражается формулой $ Q = 15000 - P, 1000 \\leqslant P \\leqslant 15000 $. Доход от продажи товара составляет $ РQ $ рублей. Затраты на производство $ Q $ единиц товара составляют $ 3000Q + 5000000 $ рублей. Прибыль равна разности дохода от продажи товара и затрат на его производство. Стремясь привлечь внимание покупателей, фирма уменьшила цену товара на $ 20\\% $, однако её прибыль не изменилась. На сколько процентов следует увеличить сниженную цену, чтобы добиться наибольшей прибыли?"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " В июле $2020$ года планируется взять кредит на некоторую сумму. Условия возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item в январе каждого года долг увеличивается на $ 30\\% $ по сравнению с предыдущим годом;\n\t\t\t\\item с февраля по июнь нужно выплатить часть долга одним платежом.\n\t\t\\end{\\itemize}\n\n\t\tОпределите, на какую сумму взяли кредита банке, если известно, что кредит был выплачен тремя равными платежами (за $3$ года) и общая сумма выплат на $ 78 030 $ рублей больше суммы взятого кредита. "
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " 15-го января планируется взять кредит в банке на некоторое количество месяцев. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item 1-го числа каждого месяца долг возврастает на $ 3\\% $ по сравнению с концом предыдущего месяца;\n\t\t\t\\item со 2-го по 14-е число каждого месяца необходимо выплатить часть долга; \\item 15-го числа каждого месяца долг должен быть на одну и ту же сумму меньше долга на 15-е число предыдущего месяца.\n\t\t\\end{\\itemize}\n\n\t\tНа сколько месяцев можно взять кредит, если известно, что общая сумма выплат после полного погашения кредита будет на $ 30\\% $ больше суммы, взятой в кредит."
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " 15-го января планируется взять кредит в банке на некоторый срок (целое число месяцев). Условие его выплаты таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item 1-го числа каждого месяца долг возрастает на $ 3\\% $ по сравнению с концом предыдущего месяца;\n\t\t\t\\item со 2-го по 14-е число каждого месяца необходимо выплатить часть долга; \\item 15-го числа каждого месяца долг должен быть на одну и ту же сумму меньше долга на 15-е число предыдущего месяца.\n\t\t\\end{\\itemize}\n\n\t\tНа сколько месяцев планируется взять кредит, если известно, что общая сумма выплат после полного погашения кредита на $ 30\\% $ больше суммы, взятой в кредит?"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " Вадим является владельцем двух заводов в разных городах. На заводах производятся абсолютно одинаковые товары при использовании одинаковых технологий. Если рабочие на одном из заводов трудятся суммарно часов в неделю, то за эту неделю они производят $t$ единиц товара. За каждый час работы на заводе, расположенном в первом городе, Вадим платит рабочему $ 500 $ рублей, а на заводе, расположенном во втором городе, — $ 300 $ рублей. Вадим готов выделять $ 1 200 000 $ рублей в неделю на оплату труда рабочих. Какое наибольшее количество единиц товара можно произвести за неделю на этих двух заводах? "
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        " 15-го января планируется взять кредит в банке на шесть месяцев в размере $1$ млн. рублей. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item 1-го числа каждого месяца долг увеличивается на $r$ процентов по сравнению с концом предыдущего месяца, где $r$ — целое число; \\item со 2-го по 14-е число каждого месяца необходимо выплатить часть долга; \\item 15-го числа каждого месяца долг должен составлять некоторую сумму в соответствии со следующей таблицей:\n\t\t\\end{\\itemize}\n\n\t\t\\begin{\\center}\n\t\t\t\\begin{\\tabular}{ |c|c|c|c|c|c|c|c| }\n\t\t\t\t \\hline Дата & 15.01 & 15.02 & 15.03 & 15.04 & 15.05 & 15.06 & 15.07 \\\\ \\hline Долг (в млн. рублей) & 1 & 0,6 & 0,4 & 0,3 & 0,2 & 0,1 & $ 0$ \\\\ \\hline \n\t\t\t\\end{\\tabular}\n\t\t\\end{\\center}\n\t\tНайдите наибольшее значение $r$, при котором общая сумма выплат будет меньше $ 1,2 $ млн. рублей. "
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        " В июле $2016$ года планируется взять кредит в банке на три года в размере $S$ млн. рублей, где $S$ — целое число. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\n\t\t\t\\item каждый январь долг увеличивается на $ 25\\% $ по сравнению с концом предыдущего года;\n\n\t\t\t\\item с февраля по июнь каждого года необходимо выплатить одним платежом часть долга;\n\n\t\t\t\\item в июле каждого года долг должен составлять часть кредита в соответствии со следующей таблицей:\n\t\t\\end{\\itemize}\n\t\t\\begin{\\center}\n\t\t\t\\begin{\\tabular}{ |c|c|c|c|c| }\n\t\t\t\t \\hline Месяц и год& 07.2016& 07.2017& 07.2018& 07.2019 \\\\ \\hline Долг (в млн. рублей) & $ S$ & $0,7 S$ & $0,4 S$ & $0$ \\\\ \\hline \n\t\t\t\\end{\\tabular}\n\t\t\\end{\\center}\n\t\tНайдите наименьшее значение $S$, при котором каждая из выплат будет больше $5$ млн. рублей. "
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        " В июле $2016$ года планируется взять кредит в банке на три года в размере $S$ млн. рублей, где $S$ — целое число. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item каждый январь долг увеличивается на $ 25\\% $ по сравнению с концом предыдущего года;\n\t\t\t\\item с февраля по июнь каждого года необходимо выплатить одним платежом часть долга; \\item в июле каждого года долг должен составлять часть кредита в соответствии со следующей таблицей:\n\t\t\\end{\\itemize}\n\t\t\\begin{\\center}\n\t\t\t\\begin{\\tabular}{ |c|c|c|c|c| }\n\t\t\t\t \\hline Месяц и год& Июль 2016& Июль 2017& Июль 2018& Июль 2019 \\\\ \\hline Долг (в млн. рублей) & $ S$ & $0,7 S$ & $0,4 S$ & $0$ \\\\ \\hline \n\t\t\t\\end{\\tabular}\n\t\t\\end{\\center}\n\t\tНайдите наибольшее значение $S$, при котором разница между наибольшей и наименьшей выплатами будет меньше $1$ млн. рублей. "
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        " Вклад в размере $10$ млн. рублей планируется открыть на четыре года. В конце каждого года банк увеличивает вклад на $ 10\\% $ по сравнению с его размером в начале года. Кроме этого, в начале третьего и четвёртого годов вкладчик ежегодно пополняет вклад на $x$ млн. рублей, где $ x $ — целое число. Найдите наименьшее значение $x$, при котором банк за четыре года начислит на вклад больше $7$ млн. рублей. "
      ]
    },
    {
      tag: "ЕГЭ 2015",
      year: 2015,
      text: [
        " Владимир является владельцем двух заводов в разных городах. На заводах производятся абсолютно одинаковые товары, но на заводе, расположенном во втором городе, используется более совершенное оборудование. В результате, если рабочие на заводе, расположенном в первом городе, трудятся суммарно $ t^2 $ часов в неделю, то за эту неделю они производят $ 2t $ единиц товара; если рабочие на заводе, расположенном во втором городе, трудятся суммарно $ t^2 $ часов в неделю, то за эту неделю они производят $ 5t $ единиц товара. За каждый час работы (на каждом из заводов) Владимир платит рабочему $ 500 $ рублей. Владимиру нужно каждую неделю производить $ 580 $ единиц товара. Какую наименьшую сумму придется тратить еженедельно на оплату труда рабочих? "
      ]
    },
    {
      tag: "ЕГЭ 2015",
      year: 2015,
      text: [
        " Григорий является владельцем двух заводов в разных городах. На заводах производятся абсолютно одинаковые товары, но на заводе, расположенном во втором городе, используется более совершенное оборудование. В результате, если рабочие на заводе, расположенном в первом городе, трудятся суммарно $t^2$ часов в неделю, то за эту неделю они производят $ 3t $ единиц товара; если рабочие на заводе, расположенном во втором городе, трудятся суммарно $t^2$ часов в неделю, то за эту неделю они производят $ 4t $ единиц товара. За каждый час работы (на каждом из заводов) Григорий платит рабочему $ 500 $ рублей. Григорий готов выделять $ 5 000 000 $ рублей в неделю на оплату труда рабочих. Какое наибольшее количество единиц товара можно произвести за неделю на этих двух заводах? "
      ]
    },
    {
      tag: "ЕГЭ 2015",
      year: 2015,
      text: [
        " 15-го января планируется взять кредит в банке на $ 19 $ месяцев. Условия его возврата таковы:\n\t\t\\begin{\\itemize}\n\t\t\t\\item 1-го числа каждого месяца долг возрастёт на $r\\%$ по сравнению с концом предыдущего месяца;\n\t\t\t\\item со 2-го по 14-е число каждого месяца необходимо выплатить часть долга; \\item 15-го числа каждого месяца долг должен быть на одну и ту же сумму меньше долга на 15-е число предыдущего месяца.\n\t\t\\end{\\itemize}\n\t\tИзвестно, что общая сумма выплат после полного погашения кредита на $ 30\\% $ больше суммы, взятой в кредит. Найдите $r$."
      ]
    }
  ]

export default economy