  const stereometry =  [
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        "В правильной шестиугольной пирамиде $ SABCDEF $ сторона основания $ AB=7$,  а боковое ребро $ SA=10$. Точка $ M $ лежит на ребре $ BC$,  причем $ BM=4$,  точка $ K $ лежит на ребре $ SC$,  причем $ SK=7$. \\begin{\\enumerate} \\item Докажите, что плоскость $ MKD $ перпендикулярна плоскости основания пирамиды.\\item  Найдите объем пирамиды $ CDKM$.   \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        "В правильной шестиугольной пирамиде $ SABCDEF $ боковое ребро $ SA=14$,  а сторона $ AB=8$. Точка $ M $ середина стороны $ AB $ Плоскость $ \\alpha $ проходит через точки $ M $ и $ D $ и перпендикулярна плоскости $ ABC$. Прямая $ SC $ пересекает плоскость $ \\alpha $ в точке $ K$. \\begin{\\enumerate} \\item Докажите, что $ MK=  KD$. \\item  Найдите объем пирамиды $ MCDK$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        "Дана правильная треугольная призма $ ABCA_1  B_1  C_1$,  в которой $ AB=6 $ и $ AA_1=3$. Точки $ O $ и $ O_1 $ являются центрами окружностей, описанных около треугольников $ ABC $ и $ A_1  B_1  C_1 $ соответственно. На ребре $ CC_1 $ отмечена точка $ M $ такая что $ CM=1$. \\begin{\\enumerate} \\item Докажите, что прямая $ OO_1 $ содержит точку пересечения медиан треугольника треугольника $ ABM$. \\item  Найдите объем пирамиды $ ABMC_1$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        "Дана пирамида $ SABC$,  в которой   $SC=SB=AB=AC=\\sqrt{ 17}$,    $SA=BC=2\\sqrt5 $. \\begin{\\enumerate} \\item Докажите, что ребро $ SA $ перпендикулярно ребру $ BC$. \\item  Найдите расстояние между ребрами $ BC $ и $ SA$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        "Дана пирамида $ SABC$,  в которой   $SC=SB=AB=AC=\\sqrt{ 19}$,    $SA=BC=2\\sqrt6 $. \\begin{\\enumerate} \\item Докажите, что ребро $ SA $ перпендикулярно ребру $ BC$. \\item  Найдите расстояние между ребрами $ BC $ и $ SA$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        "В правильной треугольной пирамиде $ SABC $ точка $ K$ — делит сторону $ SC $ в отношении   $ 1 : 2 $,  считая от вершины $ S$,  точка $ N$ — делит сторону $ SB $ в отношении   $ 1 : 2 $,  считая от вершины $ S$. Через точки $ N $ и $ K $ параллельно $ SA $ проведена плоскость   $\\omega$. \\begin{\\enumerate} \\item Докажите, что сечение пирамиды плоскостью   $\\omega$ параллельно прямой $ BC$. \\item  Найдите расстояние от точки $ B $ до плоскости   $\\omega$,  если известно, что   $SA=9$,    $AB=6$.  \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        "В правильной треугольной призме $ ABC  A_1  B_1  C_1 $ сторона основания равна $4$, а боковое ребро  равно $2$. Точка $ M$ — середина ребра $ A_1  C_1$,  а точка $ O$ — точка пересечения диагоналей боковой грани $ ABB_1  A_1$. \\begin{\\enumerate} \\item Докажите, что точка пересечения диагоналей четырёхугольника, являющегося сечением призмы $ ABC  A_1  B_1  C_1 $ плоскостью $ AMB $ лежит на отрезке $ OC_1$. \\item  Найдите угол между прямой $ OC_1$,  и плоскостью $ AMB$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        "В правильной треугольной пирамиде $ SABC $ сторона основания $ AB $ равна $6$, а боковое ребро $ SA $ равно $5$. На рёбрах $ AB $ и $ SC $ отмечены точки $ K $ и $ M $ соответственно, причём $ AK:  KB=  SM:  MC=5:1$. Плоскость $ \\alpha $ содержит прямую $ KM $ и параллельна $ SA$. \\begin{\\enumerate} \\item Докажите, что сечение пирамиды $ SABC $ плоскостью $ \\alpha $ — прямоугольник.\\item  Найдите объём пирамиды, вершиной которой является точка $ A$,  а основанием — сечение пирамиды $ SABC $ плоскостью $ \\alpha $. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        "В цилиндре образующая перпендикулярна плоскости основания. На окружности одного из оснований цилиндра выбраны точки   $A $, $ B и C $, а на окружности другого основания — точка   $C_1$, причём   $CC_1$ — образующая цилиндра, а $ AC$ — диаметр основания. Известно,что   $\\angle{ACB}=45^{\\circ}$,   $AB=2\\sqrt{ 2}, CC_1=4$.\\begin{\\enumerate} \\item Докажите,что угол между прямыми   $AC_1$ и   $BC$ равен   $60^{\\circ}$.\\item  Найдите объём цилиндра. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        "В цилиндре образующая перпендикулярна плоскости основания. На окружности одного из оснований цилиндра выбраны точки $ A $ и $ B$,  а на окружности другого основания— точки $ B_1 $ и $ C_1$,  причем $ BB_1$ — образующая цилиндра, а отрезок $ AC_1 $ пересекает ось цилиндра.\\begin{\\enumerate} \\item Докажите, что угол $ ABC_1 $ прямой.\\item  Найдите угол между прямыми $ BB_1 $ и $ AC_1$,  если $ AB=8 $, $   BB_1=6 $, $   B_1  C_1=15$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        "В цилиндре образующая перпендикулярна плоскости основания. На окружности одного из оснований цилиндра выбраны точки $ A $ и $ B$,  а на окружности другого основания— точки $ B_1 $ и $ C_1$,  причем $ BB_1$ — образующая цилиндра, а отрезок $ AC_1 $ пересекает ось цилиндра.\\begin{\\enumerate} \\item Докажите, что угол $ ABC_1 $ прямой.\\item  Найдите расстояние от точки $ B $ до прямой $ AC_1$,  если $ AB=15 $, $   BB_1=16 $, $   B_1  C_1=12$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        "В цилиндре образующая перпендикулярна плоскости основания. На окружности одного из оснований цилиндра выбраны точки $ A $ и $ B$,  а на окружности другого основания— точки $ B_1 $ и $ C_1$,  причем $ BB_1$ — образующая цилиндра, а отрезок $ AC_1 $ пересекает ось цилиндра.\\begin{\\enumerate} \\item Докажите, что угол $ ABC_1 $ прямой.\\item  Найдите площадь боковой поверхности цилиндра, если $ AB=20 $, $    BB_1=15 $, $   B_1  C_1=21$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        "В правильном тетраэдре $ ABCD $ точка $ H $ — центр грани $ ABC$,  а точка $ M $ — середина ребра $ CD$. \\begin{\\enumerate} \\item Докажите, что прямые $ AB $ и $ CD $ перпендикулярны.\\item  Найдите угол между прямыми $ DH $ и $ BM$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        "Дана четырёхугольная пирамида $ SABCD $ с прямоугольником $ ABCD $ в основании. Сторона $ AB $ равна   $3\\sqrt2 $, а $ BC $ равна $6$.  Bершина пирамиды проектируется в точку пересечения диагоналей прямоугольника. Из вершин $ A $ и $ C $ на ребро $ SB $ опущены перпендикуляры $ AP $ и $ CQ$. \\begin{\\enumerate} \\item Докажите, что точка $ P $ является серединой отрезка $ BQ$. \\item  Найдите угол между плоскостями $ SBA $ и $ SBC$,  если ребро $ SD $ равно $9$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        "Основанием прямой треугольной призмы $ ABCA_1  B_1  C_1 $ является прямоугольный треугольник $ ABC $ с прямым углом $ C$. Диагонали боковых граней $ AA_1  B_1  B $ и $ BB_1  C  C $ равны $15$ и $9$ соответственно$.  AB=13$. \\begin{\\enumerate} \\item Докажите, что треугольник $ BA_1  C_1 $ — прямоугольный.\\item  Найти объём пирамиды $ AA_1  C_1  B$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        "Hа рёбрах $ AB $ и $ BC $ треугольной пирамиды $ ABCD $ отмечены точки $ M $ и $ N $ соответственно, причём $ AM:  BM=  CN:  NB = 1 : 2$. Точки $ P $ и $ Q $ — середины сторон $ DA $ и $ DC $ соответственно.\\begin{\\enumerate} \\item Докажите, что $ P $, $   Q $, $   M $ и $ N $ лежат в одной плоскости.\\item  Найти отношение объёмов многогранников, на которые плоскость $ PQM $ разбивает пирамиду. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        "Hа ребрах $ AB $ и $ BC $ треугольной пирамиды $ ABCD $ отмечены точки $ M $ и $ N $ соответственно, причём   $AM:MB=CN:NB=3:1$.  Точки $ P $ и $ Q $ — середины сторон $ DA $ и $ DC $ соответственно.\\begin{\\enumerate} \\item Доказать, что $ P $, $   Q $, $   M $ и $ N $ лежат в одной плоскости.\\item  Найти отношение объемов многогранников, на которые плоскость $ PQM $ разбивает пирамиду. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        "В правильной треугольной призме $ ABCA_1  B_1  C_1 $ сторона основания равна $12$, а боковое ребро $ AA_1 $ равно   $3\\sqrt6 $.  На рёбрах $ AB $ и $ B_1  C_1 $ отмечены точки $ K $ и $ L$,  соответственно, причём $ AK=2$,  а $ B_1  L=4$. Точка $ M $ — середина ребра $ A_1  C_1$. Плоскость $ \\gamma $ параллельна ребру $ AC $ и содержит точки $ K $ и $ L$. \\begin{\\enumerate} \\item Докажите, что прямая $ BM $ перпендикулярна плоскости $ \\gamma $.\\item  Найдите расстояние от точки $ C $ до плоскости $ \\gamma $. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        "В правильной четырёхугольной призме $ ABCDA_1  B_1  C_1  D_1 $ сторона $ AB $ основания равна $8$, а боковое ребро $ AA_1 $ равно   $4\\sqrt2 $.  На рёбрах $ BC $ и $ C_1  D_1 $ отмечены точки $ K $ и $ L $ соответственно, причём $ BK=  C_1  L=2$. Плоскость $ \\gamma $ параллельна прямой $ BD $ и содержит точки $ K $ и $ L$. \\begin{\\enumerate} \\item Докажите, что прямая $ A_1  C $ перпендикулярна плоскости $ \\gamma $.\\item  Найдите расстояние от точки $ B $ до плоскости $ \\gamma $. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        "В правильной треугольной призме $ ABCA_1  B_1  C_1 $ сторона $ AB $ основания равна $12$, а высота призмы равна $2$. На рёбрах $ B_1  C_1 $ и $ AB $ отмечены точки $ P $ и $ Q $ соответственно, причём $ PC_1=3$,  а $ AQ=4$. Плоскость $ A_1  PQ $ пересекает ребро $ BC $ в точке $ M$. \\begin{\\enumerate} \\item Докажите, что точка $ M $ является серединой ребра $ BC$. \\item  Найдите расстояние от точки $ B $ до плоскости $ A_1  PQ$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        "Hа рёбрах $ D  D_1 $ и $ BB_1 $ куба $ ABCDA_1  B_1  C_1  D_1 $ с ребром $12$ отмечены точки $ P $ и $ Q $ соответственно, причём $ DP=10$,  а $ B_1  Q=4$. Плоскость $ A_1  PQ $ пересекает ребро $ CC_1 $ в точке $ M$. \\begin{\\enumerate} \\item Докажите, что точка $ M $ является серединой ребра $ CC_1$. \\item  Найдите расстояние от точки $ C_1 $ до плоскости $ A_1  PQ$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2015",
      year: 2015,
      text: [
        "В кубе $ ABCDA_1  B_1  C_1  D_1 $ все рёбра равны $7$. На его ребре $ BB_1 $ отмечена точка $ K $ так, что $ KB=4$. Через точки $ K $ и $ C_1 $ проведена плоскость $ \\alpha $, параллельная прямой $ BD_1$. \\begin{\\enumerate} \\item Докажите, что $ A_1  P:  PB_1=1:3$,  где $ P $ — точка пересечения плоскости $ \\alpha $ с ребром $ A_1  B_1$. \\item  Найдите объём большей из двух частей куба, на которые он делится плоскостью $ \\alpha $. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2015",
      year: 2015,
      text: [
        "В правильной четырёхугольной пирамиде $ SABCD $ все рёбра равны $5$. На рёбрах $ SA $, $   AB $, $   BC $ взяты точки $ P $, $   Q $, $   R $ соответственно так, что $ PA=AQ=RC=2$. \\begin{\\enumerate} \\item Докажите, что плоскость $ PQR $ перпендикулярна ребру $ SD$. \\item  Найдите расстояние от вершины $ D $ до плоскости $ PQR$. \\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2014",
      year: 2014,
      text: [
        "Bысота цилиндра равна $3$. Равнобедренный треугольник $ ABC $ с боковой стороной $10$ и угол$ A=120^{\\circ} $ расположен так, что его вершина $ A  $ лежит на окружности нижнего основания цилиндра, а вершины $ B $ и $ C $ — на окружности верхнего основания. Найдите угол между плоскостью $ ABC $ и плоскостью основания цилиндра."
      ]
    },
    {
      tag: "ЕГЭ 2014",
      year: 2014,
      text: [
        "В правильной треугольной пирамиде $ MABC $ с вершиной $ M $ сторона основания $ AB $ равна $6$. На ребре $ AB $ отмечена точка $ K $ так, что $ AK:  KB=5:1$. Сечение $ MKC $ является равнобедренным треугольником с основанием $ MK$. Найдите угол между боковыми гранями пирамиды."
      ]
    },
    {
      tag: "ЕГЭ 2014",
      year: 2014,
      text: [
        "В треугольной пирамиде   $MABC$ основанием является правильный треугольник   $ABC$,  ребро   $MB$ перпендикулярно плоскости основания, стороны основания равны   $3$,  а ребро   $MA=6$.  На ребре   $AC$ находится точка   $D$,  на ребре   $AB$ точка   $E$,  а на ребре   $AM$ — точка   $L$.  Известно, что   $AD=AL=2$,  и   $BE=1$.  Найдите площадь сечения пирамиды плоскостью, проходящей через точки   $E $, $ D$ и   $L$. "
      ]
    },
    {
      tag: "ЕГЭ 2013",
      year: 2013,
      text: [
        "В правильной четырёхугольной пирамиде $ MABCD $ с вершиной $ M $ стороны основания равны $3$, а боковые рёбра равны $8$. Найдите площадь сечения пирамиды плоскостью, проходящей через точку $ B $ и середину ребра $ MD $ параллельно прямой $ AC$. "
      ]
    },
    {
      tag: "ЕГЭ 2013",
      year: 2013,
      text: [
        "В правильной четырёхугольной пирамиде $ MABCD $ с вершиной $ M $ стороны основания равны $1$, а боковые рёбра равны $2$. Точка $ N $ принадлежит ребру $ MC$,  причём $ MN: NC=2:1$.  Найдите площадь сечения пирамиды плоскостью, проходящей через точки $ B $ и $ N $ параллельно прямой $ AC$.  "
      ]
    },
    {
      tag: "ЕГЭ 2013",
      year: 2013,
      text: [
        "Радиус основания конуса равен $6$, а его высота равна $8$. Плоскость сечения содержит вершину конуса и хорду основания, длина которой равна $4$. Найдите расстояние от центра основания конуса до плоскости сечения."
      ]
    }
  ]

export default stereometry