  const planeGeometry =  [
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        " Дан прямоугольный треугольник $ ABC$. На катете $ AC $ отмечена точка $ M$, а на продолжении катета $ BC $ за точку $ C$ — точка $ N $ так, что $ CM= CB $ и $ CA= CN$.\\begin{\\enumerate}\\item Пусть $ CH $ и $ CF$ — высоты треугольников $ ABC $ и $ NMC $ соответственно. Докажите, что $ CF $ и $ CH $ перпендикулярны.\\item Пусть $ L$ — это точка пересечения $ BM $ и $ AN $, $ BC=2 $, $ AC=5$. Найдите $ ML$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        " Hа сторонах $ AB $, $ BC $ и $ AC $ треугольника $ ABC $ отмечены точки $ C_1 $, $ A_1 $ и $ B_1 $ соответственно, причём $ AC_1:C_1 B= 8 : 3 $, $ BA_1: A_1 C= 1 : 2 $, $ CB_1: B_1 A=3:1$. Отрезки $ BB_1 $ и $ CC_1 $ пересекаются в точке $ D$.\\begin{\\enumerate}\\item Докажите, что $ ADA_1 B_1$ — параллелограмм.\\item Найдите $ CD$, если отрезки $ AD $ и $ BC $ перпендикулярны $, AC=28 $, $ BC=18$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        " Hа сторонах $ AB $, $ BC $ и $ AC $ треугольника $ ABC $ отмечены точки $ C_1 $, $ A_1 $ и $ B_1 $ соответственно, причём $ AC_1: C_1 B= 21 : 10 $, $ BA_1: A_1 C= 2 : 3 $, $ AB_1: B_1 C=2:5$. Отрезки $ BB_1 $ и $ CC_1 $ пересекаются в точке $ D$.\\begin{\\enumerate}\\item Докажите, что четырёхугольник $ ADA_1 B_1 $ — параллелограмм.\\item Найдите $ CD$, если отрезки $ AD $ и $ BC $ перпендикулярны $, AC = 63$, $ BC = 25$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2020",
      year: 2020,
      text: [
        " Прямоугольный треугольник $ ABC $ с прямым углом $ C $ вписан в окружность. Биссектриса угла $ A $ пересекает описанную окружность в точке $ A_1$, биссектриса угла $ B $ пересекает описанную окружность в точке $ B_1$, биссектриса угла $ C $ пересекает описанную окружность в точке $ C_1$.\\begin{\\enumerate}\\item Докажите, что угол $ A_1 BB_1=45^\\circ $.\\item Известно, что $AB=2 \\sqrt{ 3}$, $\\angle A=60^\\circ $. Найдите $ B_1 C_1$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        " Дана трапеция $ ABCD $ с основаниями $ BC $ и $ AD$. Точки $ M $ и $ N $ являются серединами сторон $ AB $ и $ CD $ соответственно. Окружность, проходящая через точки $ B $ и $ C$, пересекает отрезки $ BM $ и $ CN $ в точках $ P $ и $ Q $ (отличных от концов отрезков).\\begin{\\enumerate}\\item Докажите, что точки $ M $, $ N $, $ P $ и $ Q $ лежат на одной окружности.\\item Найдите радиус окружности, описанной около треугольника $ MPQ$, если прямая $ DP $ перпендикулярна прямой $ PC $, $ AB=25 $, $ BC=3 $, $ CD=28 $, $ AD=20$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        " Около остроугольного треугольника $ ABC $ с различными сторонами описали окружность с диаметром $ BN$. Bысота $ BH $ пересекает эту окружность в точке $ K$.\\begin{\\enumerate}\\item Докажите, что $AN=CK$. \\item Найдите $ KN$, если $\\angle BAC=35^\\circ$, $\\angle ACB=65^\\circ$, а радиус окружности равен $12$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        " Точка $ O$ — центр вписанной в треугольник $ ABC $ окружности. Прямая $ BO $ вторично пересекает описанную около этого треугольника окружность в точке $ P$.\\begin{\\enumerate}\\item Докажите, что $\\angle POC=\\angle PCO$. \\item Найдите площадь треугольника $ APC$, если радиус описанной около треугольника $ ABC $ окружности равен $8$, а $\\angle ABC = 60^\\circ$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2019",
      year: 2019,
      text: [
        " В прямоугольном треугольнике $ ABC $ точка $ M $ лежит на катете $ AC$, а точка $ N $ лежит на продолжении катета $ BC $ за точку $ C$, причём $CM=BC$ и $CN=AC$. Отрезки $ CP $ и $ CQ$ — биссектрисы треугольников $ ACB $ и $ NCM $ соответственно.\\begin{\\enumerate}\\item Докажите, что $ CP $ и $ CQ $ перпендикулярны.\\item Найдите $ PQ$, если $BC=3$, а $AC=5$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        " Четырёхугольник $ ABCD $ вписан в окружность радиуса $ R = 10$. Известно, что $ AB = BC = CD = 6$.\\begin{\\enumerate}\\item Докажите,что прямые $ BC $ и $ AD $ параллельны.\\item Найдите $ AD$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        " Окружность с центром в точке $ O $ высекает на всех сторонах трапеции $ ABCD $ равные хорды.\\begin{\\enumerate}\\item Докажите, что биссектрисы всех углов трапеции пересекаются в одной и той же точке.\\item Найдите высоту трапеции, если окружность пересекает боковую сторону $ AB $ в точках $ K $ и $ L $ так, что $ AK=15 $, $ KL=6 $, $ LB=5$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2018",
      year: 2018,
      text: [
        " Точка $ O $ — центр окружности, описанной около остроугольного треугольника $ ABC$, а $ BH $ — высота этого треугольника.\\begin{\\enumerate}\\item Докажите, что углы $ ABH $ и $ CBO $ равны.\\item Найдите $ BH$, если $AB = 16$, $ BC=18 $, $ BH=BO$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " Известно, что $ ABCD $ трапеция $, AD = 2 BC$, $ AD $, $ BC $ — основания. Точка $ M $ такова, что углы $ ABM $ и $ MCD $ прямые.\\begin{\\enumerate}\\item Доказать, что $ MA = MD$.\\item Расстояние от $ M $ до $ AD $ равно $ BC$, а угол $ ADC $ равен $5^\\circ$. Найдите угол $ BAD$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " В трапеции $ ABCD $ угол $ BAD $ прямой. Окружность, построенная на большем основании $ AD $ как на диаметре, пересекает меньшее основание $ BC $ в точке $ C $ и $ M$.\\begin{\\enumerate}\\item Докажите, что угол $ BAM $ равен углу $ CAD$.\\item Диагонали трапеции $ ABCD $ пересекаются в точке $ O$.Hайдите площадь треугольника $ AOB$, если $ AB = 6$, а $ BC = 4 BM$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " Дана равнобедренная трапеция, в которой $ AD = 3 BC$, $ CM $ — высота трапеции.\\begin{\\enumerate}\\item Доказать, что $ M $ делит $ AD $ в отношении $ 2 : 1 $.\\item Найдите расстояние от точки $ C $ до середины $ BD$, если $ AD = 18$, $ AC = 4 \\sqrt{ 13}$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " Две окружности с центрами $ O_1 $ и $ O_2 $ пересекаются в точках $ A $ и $ B$, причем точки $ O_1 $ и $ O_2 $ лежат по разные стороны от прямой $ AB$. Продолжение диаметра $ CA $ первой окружности и хорды $ CB $ этой же окружности пересекают вторую окружность в точках $ D $ и $ E $ соответственно.\\begin{\\enumerate}\\item Докажите, что треугольники $ CBD $ и $ O_1 A O_2 $ подобны.\\item Найдите $ AD$, если угол $ DAE $ равен углу $ BAC$, а радиус второй окружности в четыре раза больше радиуса первой и $ AB = 3$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2017",
      year: 2017,
      text: [
        " Две окружности касаются внутренним образом в точке $ A$, причем меньшая окружность проходит через через центр $ O $ большей. Диаметр $ BC $ большей окружности вторично пересекает меньшую окружность в точке $ M$, отличной от $ A$. Лучи $ AO $ и $ AM $ вторично пересекают большую окружность в точках $ P $ и $ Q $ соответственно. Точка $ C $ лежит на дуге $ AQ $ большей окружности, не содержащей точку $ P$.\\begin{\\enumerate}\\item Докажите, что прямые $ PQ $ и $ BC $ параллельны.\\item Известно, что $\\sin \\angle$$ AOC = $ $ \\frac{\\sqrt{ 5}}{3} $. Прямые $ PC $ и $ AQ $ пересекаются в точке $ K$. Найдите отношение $ QK:KA$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        " В треугольнике $ ABC $ угол $ ABC $ равен $60^\\circ$. Окружность, вписанная в треугольник, касается стороны $ AC $ в точке $ M$.\\begin{\\enumerate}\\item Докажите, что отрезок $ BM $ не больше утроенного радиуса вписанной в треугольник окружности.\\item Найдите $ \\sin \\angle BMC$, если известно, что отрезок $ BM $ в 2,5 раза больше радиуса вписанной в треугольник окружности.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        " В прямоугольном треугольнике $ ABC $ точки $ M $ и $ N $ — середины гипотенузы $ AB $ и катета $ BC $ соответственно. Биссектриса угла $ BAC $ пересекает прямую $ MN $ в точке $ L$.\\begin{\\enumerate}\\item Докажите, что треугольники $ AML $ и $ BLC $ подобны.\\item Найдите отношение площадей этих треугольников, если $ \\cos \\angle BAC = \\frac{7}{25} $.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2016",
      year: 2016,
      text: [
        " Окружность касается стороны $ AC $ остроугольного треугольника $ ABC $ и делит каждую из сторон $ AB $ и $ BC $ на три равные части.\\begin{\\enumerate}\\item Докажите, что треугольник $ ABC $ равнобедренный.\\item Найдите, в каком отношении высота этого треугольника делит сторону $ BC$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2015",
      year: 2015,
      text: [
        " В прямоугольной трапеции $ ABCD $ с прямым углом при вершине $ A $ расположены две окружности. Одна из них касается боковых сторон и большего основания $ AD$, вторая — боковых сторон, меньшего основания $ BC $ и первой окружности.\\begin{\\enumerate}\\item Прямая, проходящая через центры окружностей, пересекает основание $ AD $ в точке $ P$. Докажите, что $\\frac{AP}{PD} = \\sin \\angle D$. \\item Найдите площадь трапеции, если радиусы окружностей равны $3$ и $1$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2015",
      year: 2015,
      text: [
        " Дана равнобедренная трапеция $ ABCD $ с основаниями $ BC $ и $ AD$. На стороне $ AB $ как на диаметре построена окружность с центром в точке $ O$, касающаяся стороны $ CD $ и повторно пересекающая основание $ AD $ в точке $ H$. Точка $ Q$ — середина стороны $ CD$.\\begin{\\enumerate}\\item Докажите,что $ OQDH$ — параллелограмм.\\item Найдите $ AD$, если $\\angle BAD=60^\\circ $, $ BC=2$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2015",
      year: 2015,
      text: [
        " Две окружности касаются внутренним образом в точке $ A$, причём меньшая проходит через центр большей. Хорда $ BC $ большей окружности касается меньшей в точке $ P$. Хорды $ AB $ и $ AC $ пересекают меньшую окружность в точках $ K $ и $ M $ соответственно.\\begin{\\enumerate}\\item Докажите, что прямые $ KM $ и $ BC $ параллельны.\\item пусть $ L $ — точка пересечения отрезков $ KM $ и $ AP$. Найдите $ AL$, если радиус большей окружности равен $10$, а $ BC=16$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2014",
      year: 2014,
      text: [
        " К двум непересекающимся окружностям равных радиусов проведены две параллельные общие касательные. Окружности касаются одной из этих прямых в точках $ A $ и $ B $ Через точку $ C$, лежащую на отрезке $ AB$, проведены касательные к этим окружностям, пересекающие вторую прямую в точках $ D $ и $ E$, причём отрезки $ CA $ и $ CD $ касаются одной окружности, а отрезки $ CB $ и $ CE $ — другой.\\begin{\\enumerate}\\item Докажите, что периметр треугольника $ CDE $ вдвое больше расстояния между центрами окружностей.\\item Найдите $ DE$, если радиусы окружностей равны $5$, расстояние между их центрами равно $18$, а $ AC=8$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2014",
      year: 2014,
      text: [
        " Около остроугольного треугольника $ ABC $ описана окружность с центром $ O$. На продолжении отрезка $ AO $ за точку $ O $ отмечена точка $ K $ так, что $\\angle$$ BAC $ + $\\angle$$ AKC=90^\\circ$.\\begin{\\enumerate}\\item Докажите, что четырёхугольник $ OBKC $ вписанный.\\item Найдите радиус окружности, описанной около четырёхугольника $ OBKC$, если $ \\cos \\angle BAC = \\frac{3}{5} $, а $BC=48$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2014",
      year: 2014,
      text: [
        " В остроугольном треугольнике $ ABC $ провели высоту $ BH$, из точки $ H $ на стороны $ AB $ и $ BC $ опустили перпендикуляры $ HK $ и $ HM $ соответственно.\\begin{\\enumerate}\\item Докажите, что треугольник $ MBK $ подобен треугольнику $ ABC$. \\item Найдите отношение площади треугольника $ MBK $ к площади четырёхугольника $ AKMC$, если $ BH=2$, а радиус окружности, описанной около треугольника $ ABC $ равен $4$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2014",
      year: 2014,
      text: [
        " Bысоты $ BB_1 $ и $ CC_1 $ остроугольного треугольника $ ABC $ пересекаются в точке $ H$.\\begin{\\enumerate}\\item Докажите, что $\\angle AHB_1=$ $\\angle ACB$.\\item Найдите $BC$, если $ AH=4 $ и $\\angle BAC=60^\\circ$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2014",
      year: 2014,
      text: [
        " В треугольнике $ ABC $ проведена биссектриса $ AM$. Прямая, проходящая через вершину $ B $ перпендикулярно $ AM$, пересекает сторону $ AC $ в точке $ N$ $. AB = 6$ ; $ BC = 5$ ; $ AC = 9$.\\begin{\\enumerate}\\item докажите, что биссектриса угла $ C $ делит отрезок $ MN $ пополам \\item пусть $ P $ — точка пересечения биссектрис треугольника $ ABC$. Найдите отношение $ AP : PN$.\\end{\\enumerate}"
      ]
    },
    {
      tag: "ЕГЭ 2013",
      year: 2013,
      text: [
        " Окружности радиусов $3$ и $5$ с центрами $O_1$ и $O_2$ соответственно касаются в точке $A$. Прямая, проходящая через точку $A$, вторично пересекает меньшую окружность в точке $B$, а большую — в точке $C$. Найдите площадь треугольника $BCO_2$, если $\\angle ABO_1=15^\\circ$. "
      ]
    },
    {
      tag: "ЕГЭ 2013",
      year: 2013,
      text: [
        " Окружности радиусов $11$ и $21$ с центрами $O_{1}$ и $O_{2}$ соответственно касаются внешним образом в точке $C $, $ AO_{1}$ и $BO_{2}$ — параллельные радиусы этих окружностей, причём $\\angle AO_{1}O_{2} = 60^\\circ$ Найдите $AB$. "
      ]
    },
    {
      tag: "ЕГЭ 2013",
      year: 2013,
      text: [
        " Угол $ C $ треугольника $ ABC $ равен $30^\\circ $, $ D $ — отличная от $ A $ точка пересечения окружностей, построенных на сторонах $ AB $ и $ AC $ как на диаметрах. Известно, что $ BD: DC=1:6$. Найдите синус угла $ A$. "
      ]
    },
    {
      tag: "ЕГЭ 2013",
      year: 2013,
      text: [
        " Окружность радиуса $12 \\sqrt2 $ вписана в прямой угол. Bторая окружность также вписана в этот угол и пересекается с первой в точках $M$ и $N$. Известно, что расстояние между центрами окружностей равно $16$. Найдите $MN$."
      ]
    }
  ]

export default planeGeometry